Revit 2027 API
CurtainGrid.Grid1Justification Property
The justification for the U grid line pattern of the curtain grid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CurtainGridAlignType Grid1Justification { get; set; }
Public Property Grid1Justification As CurtainGridAlignType
	Get
	Set
public:
property CurtainGridAlignType Grid1Justification {
	CurtainGridAlignType get ();
	void set (CurtainGridAlignType value);
}
member Grid1Justification : CurtainGridAlignType with get, set
Property Value
CurtainGridAlignType
See Also
Reference
CurtainGrid Class
Autodesk.Revit.DB Namespace